hornmich/tms570ls3137-hdk-sdram/SDRAM_SCI_configuration/include/hw_emac.h
#define EMAC_RXINTSTATRAW_RX4PEND (0x00000010U)
#define EMAC_RXINTSTATRAW_RX4PEND_SHIFT (0x00000004U)

#define EMAC_RXINTSTATRAW_RX3PEND (0x00000008U)
#define EMAC_RXINTSTATRAW_RX3PEND_SHIFT (0x00000003U)

#define EMAC_RXINTSTATRAW_RX2PEND (0x00000004U)
#define EMAC_RXINTSTATRAW_RX2PEND_SHIFT (0x00000002U)

#define EMAC_RXINTSTATRAW_RX1PEND (0x00000002U)
#define EMAC_RXINTSTATRAW_RX1PEND_SHIFT (0x00000001U)

#define EMAC_RXINTSTATRAW_RX0PEND (0x00000001U)
#define EMAC_RXINTSTATRAW_RX0PEND_SHIFT (0x00000000U)


/* RXINTSTATMASKED */


#define EMAC_RXINTSTATMASKED_RX7THRESHPEND (0x00008000U)
#define EMAC_RXINTSTATMASKED_RX7THRESHPEND_SHIFT (0x0000000FU)

#define EMAC_RXINTSTATMASKED_RX6THRESHPEND (0x00004000U)
#define EMAC_RXINTSTATMASKED_RX6THRESHPEND_SHIFT (0x0000000EU)

#define EMAC_RXINTSTATMASKED_RX5THRESHPEND (0x00002000U)
#define EMAC_RXINTSTATMASKED_RX5THRESHPEND_SHIFT (0x0000000DU)

#define EMAC_RXINTSTATMASKED_RX4THRESHPEND (0x00001000U)
#define EMAC_RXINTSTATMASKED_RX4THRESHPEND_SHIFT (0x0000000CU)

#define EMAC_RXINTSTATMASKED_RX3THRESHPEND (0x00000800U)
#define EMAC_RXINTSTATMASKED_RX3THRESHPEND_SHIFT (0x0000000BU)

#define EMAC_RXINTSTATMASKED_RX2THRESHPEND (0x00000400U)
#define EMAC_RXINTSTATMASKED_RX2THRESHPEND_SHIFT (0x0000000AU)

#define EMAC_RXINTSTATMASKED_RX1THRESHPEND (0x00000200U)
#define EMAC_RXINTSTATMASKED_RX1THRESHPEND_SHIFT (0x00000009U)

#define EMAC_RXINTSTATMASKED_RX0THRESHPEND (0x00000100U)
#define EMAC_RXINTSTATMASKED_RX0THRESHPEND_SHIFT (0x00000008U)

#define EMAC_RXINTSTATMASKED_RX7PEND (0x00000080U)
#define EMAC_RXINTSTATMASKED_RX7PEND_SHIFT (0x00000007U)

#define EMAC_RXINTSTATMASKED_RX6PEND (0x00000040U)
#define EMAC_RXINTSTATMASKED_RX6PEND_SHIFT (0x00000006U)

#define EMAC_RXINTSTATMASKED_RX5PEND (0x00000020U)
#define EMAC_RXINTSTATMASKED_RX5PEND_SHIFT (0x00000005U)

#define EMAC_RXINTSTATMASKED_RX4PEND (0x00000010U)
#define EMAC_RXINTSTATMASKED_RX4PEND_SHIFT (0x00000004U)

#define EMAC_RXINTSTATMASKED_RX3PEND (0x00000008U)
#define EMAC_RXINTSTATMASKED_RX3PEND_SHIFT (0x00000003U)

#define EMAC_RXINTSTATMASKED_RX2PEND (0x00000004U)
#define EMAC_RXINTSTATMASKED_RX2PEND_SHIFT (0x00000002U)

#define EMAC_RXINTSTATMASKED_RX1PEND (0x00000002U)
#define EMAC_RXINTSTATMASKED_RX1PEND_SHIFT (0x00000001U)

#define EMAC_RXINTSTATMASKED_RX0PEND (0x00000001U)
#define EMAC_RXINTSTATMASKED_RX0PEND_SHIFT (0x00000000U)


/* RXINTMASKSET */


#define EMAC_RXINTMASKSET_RX7THRESHMASK (0x00008000U)
#define EMAC_RXINTMASKSET_RX7THRESHMASK_SHIFT (0x0000000FU)

#define EMAC_RXINTMASKSET_RX6THRESHMASK (0x00004000U)
#define EMAC_RXINTMASKSET_RX6THRESHMASK_SHIFT (0x0000000EU)

#define EMAC_RXINTMASKSET_RX5THRESHMASK (0x00002000U)
#define EMAC_RXINTMASKSET_RX5THRESHMASK_SHIFT (0x0000000DU)

#define EMAC_RXINTMASKSET_RX4THRESHMASK (0x00001000U)
#define EMAC_RXINTMASKSET_RX4THRESHMASK_SHIFT (0x0000000CU)

#define EMAC_RXINTMASKSET_RX3THRESHMASK (0x00000800U)
#define EMAC_RXINTMASKSET_RX3THRESHMASK_SHIFT (0x0000000BU)

#define EMAC_RXINTMASKSET_RX2THRESHMASK (0x00000400U)
#define EMAC_RXINTMASKSET_RX2THRESHMASK_SHIFT (0x0000000AU)

#define EMAC_RXINTMASKSET_RX1THRESHMASK (0x00000200U)
#define EMAC_RXINTMASKSET_RX1THRESHMASK_SHIFT (0x00000009U)

#define EMAC_RXINTMASKSET_RX0THRESHMASK (0x00000100U)
#define EMAC_RXINTMASKSET_RX0THRESHMASK_SHIFT (0x00000008U)

#define EMAC_RXINTMASKSET_RX7MASK (0x00000080U)
#define EMAC_RXINTMASKSET_RX7MASK_SHIFT (0x00000007U)

#define EMAC_RXINTMASKSET_RX6MASK (0x00000040U)
#define EMAC_RXINTMASKSET_RX6MASK_SHIFT (0x00000006U)

#define EMAC_RXINTMASKSET_RX5MASK (0x00000020U)
#define EMAC_RXINTMASKSET_RX5MASK_SHIFT (0x00000005U)

#define EMAC_RXINTMASKSET_RX4MASK (0x00000010U)
#define EMAC_RXINTMASKSET_RX4MASK_SHIFT (0x00000004U)

#define EMAC_RXINTMASKSET_RX3MASK (0x00000008U)
#define EMAC_RXINTMASKSET_RX3MASK_SHIFT (0x00000003U)

#define EMAC_RXINTMASKSET_RX2MASK (0x00000004U)
#define EMAC_RXINTMASKSET_RX2MASK_SHIFT (0x00000002U)

#define EMAC_RXINTMASKSET_RX1MASK (0x00000002U)
#define EMAC_RXINTMASKSET_RX1MASK_SHIFT (0x00000001U)

#define EMAC_RXINTMASKSET_RX0MASK (0x00000001U)
#define EMAC_RXINTMASKSET_RX0MASK_SHIFT (0x00000000U)


/* RXINTMASKCLEAR */


#define EMAC_RXINTMASKCLEAR_RX7THRESHMASK (0x00008000U)
#define EMAC_RXINTMASKCLEAR_RX7THRESHMASK_SHIFT (0x0000000FU)

#define EMAC_RXINTMASKCLEAR_RX6THRESHMASK (0x00004000U)
#define EMAC_RXINTMASKCLEAR_RX6THRESHMASK_SHIFT (0x0000000EU)

#define EMAC_RXINTMASKCLEAR_RX5THRESHMASK (0x00002000U)
#define EMAC_RXINTMASKCLEAR_RX5THRESHMASK_SHIFT (0x0000000DU)

#define EMAC_RXINTMASKCLEAR_RX4THRESHMASK (0x00001000U)
#define EMAC_RXINTMASKCLEAR_RX4THRESHMASK_SHIFT (0x0000000CU)

#define EMAC_RXINTMASKCLEAR_RX3THRESHMASK (0x00000800U)
#define EMAC_RXINTMASKCLEAR_RX3THRESHMASK_SHIFT (0x0000000BU)

#define EMAC_RXINTMASKCLEAR_RX2THRESHMASK (0x00000400U)
#define EMAC_RXINTMASKCLEAR_RX2THRESHMASK_SHIFT (0x0000000AU)

#define EMAC_RXINTMASKCLEAR_RX1THRESHMASK (0x00000200U)
#define EMAC_RXINTMASKCLEAR_RX1THRESHMASK_SHIFT (0x00000009U)

#define EMAC_RXINTMASKCLEAR_RX0THRESHMASK (0x00000100U)
#define EMAC_RXINTMASKCLEAR_RX0THRESHMASK_SHIFT (0x00000008U)

#define EMAC_RXINTMASKCLEAR_RX7MASK (0x00000080U)
#define EMAC_RXINTMASKCLEAR_RX7MASK_SHIFT (0x00000007U)

#define EMAC_RXINTMASKCLEAR_RX6MASK (0x00000040U)
#define EMAC_RXINTMASKCLEAR_RX6MASK_SHIFT (0x00000006U)

#define EMAC_RXINTMASKCLEAR_RX5MASK (0x00000020U)
#define EMAC_RXINTMASKCLEAR_RX5MASK_SHIFT (0x00000005U)

#define EMAC_RXINTMASKCLEAR_RX4MASK (0x00000010U)
#define EMAC_RXINTMASKCLEAR_RX4MASK_SHIFT (0x00000004U)

#define EMAC_RXINTMASKCLEAR_RX3MASK (0x00000008U)
#define EMAC_RXINTMASKCLEAR_RX3MASK_SHIFT (0x00000003U)

#define EMAC_RXINTMASKCLEAR_RX2MASK (0x00000004U)
#define EMAC_RXINTMASKCLEAR_RX2MASK_SHIFT (0x00000002U)

#define EMAC_RXINTMASKCLEAR_RX1MASK (0x00000002U)
#define EMAC_RXINTMASKCLEAR_RX1MASK_SHIFT (0x00000001U)

#define EMAC_RXINTMASKCLEAR_RX0MASK (0x00000001U)
#define EMAC_RXINTMASKCLEAR_RX0MASK_SHIFT (0x00000000U)


/* MACINTSTATRAW */


