hornmich/tms570ls3137-hdk-sdram/SDRAM_SCI_configuration/include/hw_emac.h
#define EMAC_MACINTSTATRAW_HOSTPEND (0x00000002U)
#define EMAC_MACINTSTATRAW_HOSTPEND_SHIFT (0x00000001U)

#define EMAC_MACINTSTATRAW_STATPEND (0x00000001U)
#define EMAC_MACINTSTATRAW_STATPEND_SHIFT (0x00000000U)


/* MACINTSTATMASKED */


#define EMAC_MACINTSTATMASKED_HOSTPEND (0x00000002U)
#define EMAC_MACINTSTATMASKED_HOSTPEND_SHIFT (0x00000001U)

#define EMAC_MACINTSTATMASKED_STATPEND (0x00000001U)
#define EMAC_MACINTSTATMASKED_STATPEND_SHIFT (0x00000000U)


/* MACINTMASKSET */


#define EMAC_MACINTMASKSET_HOSTMASK (0x00000002U)
#define EMAC_MACINTMASKSET_HOSTMASK_SHIFT (0x00000001U)

#define EMAC_MACINTMASKSET_STATMASK (0x00000001U)
#define EMAC_MACINTMASKSET_STATMASK_SHIFT (0x00000000U)


/* MACINTMASKCLEAR */


#define EMAC_MACINTMASKCLEAR_HOSTMASK (0x00000002U)
#define EMAC_MACINTMASKCLEAR_HOSTMASK_SHIFT (0x00000001U)

#define EMAC_MACINTMASKCLEAR_STATMASK (0x00000001U)
#define EMAC_MACINTMASKCLEAR_STATMASK_SHIFT (0x00000000U)


/* RXMBPENABLE */


#define EMAC_RXMBPENABLE_RXPASSCRC (0x40000000U)
#define EMAC_RXMBPENABLE_RXPASSCRC_SHIFT (0x0000001EU)
#define EMAC_RXMBPENABLE_RXQOSEN (0x20000000U)
#define EMAC_RXMBPENABLE_RXQOSEN_SHIFT (0x0000001DU)
#define EMAC_RXMBPENABLE_RXNOCHAIN (0x10000000U)
#define EMAC_RXMBPENABLE_RXNOCHAIN_SHIFT (0x0000001CU)
#define EMAC_RXMBPENABLE_RXCMFEN (0x01000000U)
#define EMAC_RXMBPENABLE_RXCMFEN_SHIFT (0x00000018U)
#define EMAC_RXMBPENABLE_RXCSFEN (0x00800000U)
#define EMAC_RXMBPENABLE_RXCSFEN_SHIFT (0x00000017U)
#define EMAC_RXMBPENABLE_RXCEFEN (0x00400000U)
#define EMAC_RXMBPENABLE_RXCEFEN_SHIFT (0x00000016U)
#define EMAC_RXMBPENABLE_RXCAFEN (0x00200000U)
#define EMAC_RXMBPENABLE_RXCAFEN_SHIFT (0x00000015U)
/*----RXCAFEN Tokens----*/
#define EMAC_RXMBPENABLE_RXPROMCH (0x00070000U)
#define EMAC_RXMBPENABLE_RXPROMCH_SHIFT (0x00000010U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA0 (0x00000000U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA1 (0x00000001U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA2 (0x00000002U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA3 (0x00000003U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA4 (0x00000004U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA5 (0x00000005U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA6 (0x00000006U)
#define EMAC_RXMBPENABLE_RXPROMCH_CHA7 (0x00000007U)


#define EMAC_RXMBPENABLE_RXBROADEN (0x00002000U)
#define EMAC_RXMBPENABLE_RXBROADEN_SHIFT (0x0000000DU)
#define EMAC_RXMBPENABLE_RXBROADCH (0x00000700U)
#define EMAC_RXMBPENABLE_RXBROADCH_SHIFT (0x00000008U)
/*----RXBROADCH Tokens----*/
#define EMAC_RXMBPENABLE_RXBROADCH_CHA0 (0x00000000U)
#define EMAC_RXMBPENABLE_RXBROADCH_CHA1 (0x00000001U)
#define EMAC_RXMBPENABLE_RXBROADCH_CHA2 (0x00000002U)
#define EMAC_RXMBPENABLE_RXBROADCH_CHA3 (0x00000003U)
#define EMAC_RXMBPENABLE_RXBROADCH_CHA4 (0x00000004U)
#define EMAC_RXMBPENABLE_RXBROADCH_CHA5 (0x00000005U)
#define EMAC_RXMBPENABLE_RXBROADCH_CHA6 (0x00000006U)
#define EMAC_RXMBPENABLE_RXBROADCH_CHA7 (0x00000007U)


#define EMAC_RXMBPENABLE_RXMULTEN (0x00000020U)
#define EMAC_RXMBPENABLE_RXMULTEN_SHIFT (0x00000005U)
#define EMAC_RXMBPENABLE_RXMULTCH (0x00000007U)
#define EMAC_RXMBPENABLE_RXMULTCH_SHIFT (0x00000000U)
/*----RXMULTCH Tokens----*/
#define EMAC_RXMBPENABLE_RXMULTCH_CHA0 (0x00000000U)
#define EMAC_RXMBPENABLE_RXMULTCH_CHA1 (0x00000001U)
#define EMAC_RXMBPENABLE_RXMULTCH_CHA2 (0x00000002U)
#define EMAC_RXMBPENABLE_RXMULTCH_CHA3 (0x00000003U)
#define EMAC_RXMBPENABLE_RXMULTCH_CHA4 (0x00000004U)
#define EMAC_RXMBPENABLE_RXMULTCH_CHA5 (0x00000005U)
#define EMAC_RXMBPENABLE_RXMULTCH_CHA6 (0x00000006U)
#define EMAC_RXMBPENABLE_RXMULTCH_CHA7 (0x00000007U)


/* RXUNICASTSET */


#define EMAC_RXUNICASTSET_RXCH7EN (0x00000080U)
#define EMAC_RXUNICASTSET_RXCH7EN_SHIFT (0x00000007U)
#define EMAC_RXUNICASTSET_RXCH6EN (0x00000040U)
#define EMAC_RXUNICASTSET_RXCH6EN_SHIFT (0x00000006U)
#define EMAC_RXUNICASTSET_RXCH5EN (0x00000020U)
#define EMAC_RXUNICASTSET_RXCH5EN_SHIFT (0x00000005U)
#define EMAC_RXUNICASTSET_RXCH4EN (0x00000010U)
#define EMAC_RXUNICASTSET_RXCH4EN_SHIFT (0x00000004U)
#define EMAC_RXUNICASTSET_RXCH3EN (0x00000008U)
#define EMAC_RXUNICASTSET_RXCH3EN_SHIFT (0x00000003U)
#define EMAC_RXUNICASTSET_RXCH2EN (0x00000004U)
#define EMAC_RXUNICASTSET_RXCH2EN_SHIFT (0x00000002U)
#define EMAC_RXUNICASTSET_RXCH1EN (0x00000002U)
#define EMAC_RXUNICASTSET_RXCH1EN_SHIFT (0x00000001U)
#define EMAC_RXUNICASTSET_RXCH0EN (0x00000001U)
#define EMAC_RXUNICASTSET_RXCH0EN_SHIFT (0x00000000U)

/* RXUNICASTCLEAR */


#define EMAC_RXUNICASTCLEAR_RXCH7EN (0x00000080U)
#define EMAC_RXUNICASTCLEAR_RXCH7EN_SHIFT (0x00000007U)
#define EMAC_RXUNICASTCLEAR_RXCH6EN (0x00000040U)
#define EMAC_RXUNICASTCLEAR_RXCH6EN_SHIFT (0x00000006U)
#define EMAC_RXUNICASTCLEAR_RXCH5EN (0x00000020U)
#define EMAC_RXUNICASTCLEAR_RXCH5EN_SHIFT (0x00000005U)
#define EMAC_RXUNICASTCLEAR_RXCH4EN (0x00000010U)
#define EMAC_RXUNICASTCLEAR_RXCH4EN_SHIFT (0x00000004U)
#define EMAC_RXUNICASTCLEAR_RXCH3EN (0x00000008U)
#define EMAC_RXUNICASTCLEAR_RXCH3EN_SHIFT (0x00000003U)
#define EMAC_RXUNICASTCLEAR_RXCH2EN (0x00000004U)
#define EMAC_RXUNICASTCLEAR_RXCH2EN_SHIFT (0x00000002U)
#define EMAC_RXUNICASTCLEAR_RXCH1EN (0x00000002U)
#define EMAC_RXUNICASTCLEAR_RXCH1EN_SHIFT (0x00000001U)
#define EMAC_RXUNICASTCLEAR_RXCH0EN (0x00000001U)
#define EMAC_RXUNICASTCLEAR_RXCH0EN_SHIFT (0x00000000U)

/* RXMAXLEN */


#define EMAC_RXMAXLEN_RXMAXLEN  (0x0000FFFFU)
#define EMAC_RXMAXLEN_RXMAXLEN_SHIFT (0x00000000U)


/* RXBUFFEROFFSET */


#define EMAC_RXBUFFEROFFSET_RXBUFFEROFFSET (0x0000FFFFU)
#define EMAC_RXBUFFEROFFSET_RXBUFFEROFFSET_SHIFT (0x00000000U)


/* RXFILTERLOWTHRESH */


#define EMAC_RXFILTERLOWTHRESH_RXFILTERTHRESH (0x000000FFU)
#define EMAC_RXFILTERLOWTHRESH_RXFILTERTHRESH_SHIFT (0x00000000U)


/* RX0FLOWTHRESH */


#define EMAC_RX0FLOWTHRESH_RX0FLOWTHRESH (0x000000FFU)
#define EMAC_RX0FLOWTHRESH_RX0FLOWTHRESH_SHIFT (0x00000000U)


/* RX1FLOWTHRESH */


#define EMAC_RX1FLOWTHRESH_RX1FLOWTHRESH (0x000000FFU)
#define EMAC_RX1FLOWTHRESH_RX1FLOWTHRESH_SHIFT (0x00000000U)


/* RX2FLOWTHRESH */


#define EMAC_RX2FLOWTHRESH_RX2FLOWTHRESH (0x000000FFU)
#define EMAC_RX2FLOWTHRESH_RX2FLOWTHRESH_SHIFT (0x00000000U)


/* RX3FLOWTHRESH */


