hornmich/tms570ls3137-hdk-sdram/SDRAM_SCI_configuration/include/hw_emac.h
#define EMAC_MACCONFIG_ADDRESSTYPE (0x0000FF00U)
#define EMAC_MACCONFIG_ADDRESSTYPE_SHIFT (0x00000008U)

#define EMAC_MACCONFIG_MACCFIG  (0x000000FFU)
#define EMAC_MACCONFIG_MACCFIG_SHIFT (0x00000000U)


/* SOFTRESET */


#define EMAC_SOFTRESET_SOFTRESET (0x00000001U)
#define EMAC_SOFTRESET_SOFTRESET_SHIFT (0x00000000U)

/* MACSRCADDRLO */


#define EMAC_MACSRCADDRLO_MACSRCADDR0 (0x0000FF00U)
#define EMAC_MACSRCADDRLO_MACSRCADDR0_SHIFT (0x00000008U)
#define EMAC_MACSRCADDRLO_MACSRCADDR1 (0x000000FFU)
#define EMAC_MACSRCADDRLO_MACSRCADDR1_SHIFT (0x00000000U)


/* MACSRCADDRHI */

#define EMAC_MACSRCADDRHI_MACSRCADDR2 (0xFF000000U)
#define EMAC_MACSRCADDRHI_MACSRCADDR2_SHIFT (0x00000018U)

#define EMAC_MACSRCADDRHI_MACSRCADDR3 (0x00FF0000U)
#define EMAC_MACSRCADDRHI_MACSRCADDR3_SHIFT (0x00000010U)

#define EMAC_MACSRCADDRHI_MACSRCADDR4 (0x0000FF00U)
#define EMAC_MACSRCADDRHI_MACSRCADDR4_SHIFT (0x00000008U)

#define EMAC_MACSRCADDRHI_MACSRCADDR5 (0x000000FFU)
#define EMAC_MACSRCADDRHI_MACSRCADDR5_SHIFT (0x00000000U)


/* MACHASH1 */

#define EMAC_MACHASH1_MACHASH1  (0xFFFFFFFFU)
#define EMAC_MACHASH1_MACHASH1_SHIFT (0x00000000U)


/* MACHASH2 */

#define EMAC_MACHASH2_MACHASH2  (0xFFFFFFFFU)
#define EMAC_MACHASH2_MACHASH2_SHIFT (0x00000000U)


/* BOFFTEST */


#define EMAC_BOFFTEST_RNDNUM    (0x03FF0000U)
#define EMAC_BOFFTEST_RNDNUM_SHIFT   (0x00000010U)

#define EMAC_BOFFTEST_COLLCOUNT (0x0000F000U)
#define EMAC_BOFFTEST_COLLCOUNT_SHIFT (0x0000000CU)


#define EMAC_BOFFTEST_TXBACKOFF (0x000003FFU)
#define EMAC_BOFFTEST_TXBACKOFF_SHIFT (0x00000000U)


/* TPACETEST */


#define EMAC_TPACETEST_PACEVAL  (0x0000001FU)
#define EMAC_TPACETEST_PACEVAL_SHIFT (0x00000000U)


/* RXPAUSE */


#define EMAC_RXPAUSE_PAUSETIMER (0x0000FFFFU)
#define EMAC_RXPAUSE_PAUSETIMER_SHIFT (0x00000000U)


/* TXPAUSE */


#define EMAC_TXPAUSE_PAUSETIMER (0x0000FFFFU)
#define EMAC_TXPAUSE_PAUSETIMER_SHIFT (0x00000000U)


/* RXGOODFRAMES */

#define EMAC_RXGOODFRAMES_COUNT (0xFFFFFFFFU)
#define EMAC_RXGOODFRAMES_COUNT_SHIFT (0x00000000U)


/* RXBCASTFRAMES */

#define EMAC_RXBCASTFRAMES_COUNT (0xFFFFFFFFU)
#define EMAC_RXBCASTFRAMES_COUNT_SHIFT (0x00000000U)


/* RXMCASTFRAMES */

#define EMAC_RXMCASTFRAMES_COUNT (0xFFFFFFFFU)
#define EMAC_RXMCASTFRAMES_COUNT_SHIFT (0x00000000U)


/* RXPAUSEFRAMES */

#define EMAC_RXPAUSEFRAMES_COUNT (0xFFFFFFFFU)
#define EMAC_RXPAUSEFRAMES_COUNT_SHIFT (0x00000000U)


/* RXCRCERRORS */

#define EMAC_RXCRCERRORS_COUNT  (0xFFFFFFFFU)
#define EMAC_RXCRCERRORS_COUNT_SHIFT (0x00000000U)


/* RXALIGNCODEERRORS */

#define EMAC_RXALIGNCODEERRORS_COUNT (0xFFFFFFFFU)
#define EMAC_RXALIGNCODEERRORS_COUNT_SHIFT (0x00000000U)


/* RXOVERSIZED */

#define EMAC_RXOVERSIZED_COUNT  (0xFFFFFFFFU)
#define EMAC_RXOVERSIZED_COUNT_SHIFT (0x00000000U)


/* RXJABBER */

#define EMAC_RXJABBER_COUNT     (0xFFFFFFFFU)
#define EMAC_RXJABBER_COUNT_SHIFT    (0x00000000U)


/* RXUNDERSIZED */

#define EMAC_RXUNDERSIZED_COUNT (0xFFFFFFFFU)
#define EMAC_RXUNDERSIZED_COUNT_SHIFT (0x00000000U)


/* RXFRAGMENTS */

#define EMAC_RXFRAGMENTS_COUNT  (0xFFFFFFFFU)
#define EMAC_RXFRAGMENTS_COUNT_SHIFT (0x00000000U)


/* RXFILTERED */

#define EMAC_RXFILTERED_COUNT   (0xFFFFFFFFU)
#define EMAC_RXFILTERED_COUNT_SHIFT  (0x00000000U)


/* RXQOSFILTERED */

#define EMAC_RXQOSFILTERED_COUNT (0xFFFFFFFFU)
#define EMAC_RXQOSFILTERED_COUNT_SHIFT (0x00000000U)


/* RXOCTETS */

#define EMAC_RXOCTETS_COUNT     (0xFFFFFFFFU)
#define EMAC_RXOCTETS_COUNT_SHIFT    (0x00000000U)


/* TXGOODFRAMES */

#define EMAC_TXGOODFRAMES_COUNT (0xFFFFFFFFU)
#define EMAC_TXGOODFRAMES_COUNT_SHIFT (0x00000000U)


/* TXBCASTFRAMES */

#define EMAC_TXBCASTFRAMES_COUNT (0xFFFFFFFFU)
#define EMAC_TXBCASTFRAMES_COUNT_SHIFT (0x00000000U)


/* TXMCASTFRAMES */

#define EMAC_TXMCASTFRAMES_COUNT (0xFFFFFFFFU)
#define EMAC_TXMCASTFRAMES_COUNT_SHIFT (0x00000000U)


/* TXPAUSEFRAMES */

#define EMAC_TXPAUSEFRAMES_COUNT (0xFFFFFFFFU)
#define EMAC_TXPAUSEFRAMES_COUNT_SHIFT (0x00000000U)


/* TXDEFERRED */

#define EMAC_TXDEFERRED_COUNT   (0xFFFFFFFFU)
#define EMAC_TXDEFERRED_COUNT_SHIFT  (0x00000000U)


/* TXCOLLISION */

#define EMAC_TXCOLLISION_COUNT  (0xFFFFFFFFU)
#define EMAC_TXCOLLISION_COUNT_SHIFT (0x00000000U)


/* TXSINGLECOLL */

#define EMAC_TXSINGLECOLL_COUNT (0xFFFFFFFFU)
#define EMAC_TXSINGLECOLL_COUNT_SHIFT (0x00000000U)


/* TXMULTICOLL */

#define EMAC_TXMULTICOLL_COUNT  (0xFFFFFFFFU)
#define EMAC_TXMULTICOLL_COUNT_SHIFT (0x00000000U)


/* TXEXCESSIVECOLL */

#define EMAC_TXEXCESSIVECOLL_COUNT (0xFFFFFFFFU)
#define EMAC_TXEXCESSIVECOLL_COUNT_SHIFT (0x00000000U)


/* TXLATECOLL */

#define EMAC_TXLATECOLL_COUNT   (0xFFFFFFFFU)
#define EMAC_TXLATECOLL_COUNT_SHIFT  (0x00000000U)


/* TXUNDERRUN */

#define EMAC_TXUNDERRUN_COUNT   (0xFFFFFFFFU)
#define EMAC_TXUNDERRUN_COUNT_SHIFT  (0x00000000U)


/* TXCARRIERSENSE */

#define EMAC_TXCARRIERSENSE_COUNT (0xFFFFFFFFU)
#define EMAC_TXCARRIERSENSE_COUNT_SHIFT (0x00000000U)


/* TXOCTETS */

#define EMAC_TXOCTETS_COUNT     (0xFFFFFFFFU)
#define EMAC_TXOCTETS_COUNT_SHIFT    (0x00000000U)


/* FRAME64 */

#define EMAC_FRAME64_COUNT      (0xFFFFFFFFU)
#define EMAC_FRAME64_COUNT_SHIFT     (0x00000000U)


/* FRAME65T127 */

#define EMAC_FRAME65T127_COUNT  (0xFFFFFFFFU)
#define EMAC_FRAME65T127_COUNT_SHIFT (0x00000000U)


/* FRAME128T255 */

#define EMAC_FRAME128T255_COUNT (0xFFFFFFFFU)
#define EMAC_FRAME128T255_COUNT_SHIFT (0x00000000U)


/* FRAME256T511 */

#define EMAC_FRAME256T511_COUNT (0xFFFFFFFFU)
#define EMAC_FRAME256T511_COUNT_SHIFT (0x00000000U)


/* FRAME512T1023 */

#define EMAC_FRAME512T1023_COUNT (0xFFFFFFFFU)
#define EMAC_FRAME512T1023_COUNT_SHIFT (0x00000000U)


/* FRAME1024TUP */

#define EMAC_FRAME1024TUP_COUNT (0xFFFFFFFFU)
#define EMAC_FRAME1024TUP_COUNT_SHIFT (0x00000000U)


/* NETOCTETS */

